EDT/МП_СКАН/src/Documents/Сканирование/Сканирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Сканирование</name>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСканирования</name>
    <type>
      <types>EnumRef.РежимыСканирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныеВесы</name>
    <type>
      <types>CatalogRef.ЭлектронныеВесы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросВесаСЭлектронныхВесов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалеты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсключитьЧастичноПринятыйЗаказИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыКПогрузке</name>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СервисныеШК</name>
  </tabularSections>
</mdclass:Document>

EDT/МП_СКАН/src/Enums/РежимыСканирования/РежимыСканирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыСканирования</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаДоставку</name>
  </enumValues>
  <enumValues>
    <name>НепогруженныеЗаказы</name>
  </enumValues>
</mdclass:Enum>

EDT/МП_СКАН/src/Documents/Сканирование/Forms/ФормаВыбораРежима/Module.bsl
&НаКлиенте
Процедура РежимСканированияПриИзменении(Элемент)
	//ЭтаФорма.Закрыть(РежимСканирования);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//РежимСканирования = ПредопределенноеЗначение("Перечисление.РежимыСканирования.Приход");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПриходНажатие(Элемент)
	ЭтаФорма.Закрыть( ПредопределенноеЗначение("Перечисление.РежимыСканирования.Приход"));
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияДоставкаНажатие(Элемент)
	ЭтаФорма.Закрыть( ПредопределенноеЗначение("Перечисление.РежимыСканирования.ПередачаНаДоставку"));
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияНеВлезлоНажатие(Элемент)
	ЭтаФорма.Закрыть( ПредопределенноеЗначение("Перечисление.РежимыСканирования.НепогруженныеЗаказы"));
КонецПроцедуры
